иб/src/Catalogs/КлассификаторЕдиницИзмерения/КлассификаторЕдиницИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторЕдиницИзмерения</name>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование единицы измерения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоКлассификатору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

иб/src/Catalogs/КлассификаторЕдиницИзмерения/Forms/ФормаВыбораИзКлассификатора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтотОбъект.Параметры.Свойство("СтрокаПоиска") Тогда
		СтрокаПоиска = ЭтотОбъект.Параметры.СтрокаПоиска;
	КонецЕсли;
	
	Макет = Справочники.КлассификаторЕдиницИзмерения.ПолучитьМакет("КлассификаторЕдиницИзмерения");
	ТабДокумент.Вывести(Макет);
	ТабДокумент.ФиксацияСверху = 1;
	
	ОбластьКодЧисловойЛево          = Макет.Области.КодЧисловой.Лево;
	ОбластьКодЧисловойПраво         = Макет.Области.КодЧисловой.Право;
	ОбластьНаименованиеКраткоеЛево  = Макет.Области.НаименованиеКраткое.Лево;
	ОбластьНаименованиеКраткоеПраво = Макет.Области.НаименованиеКраткое.Право;
	ОбластьНаименованиеПолноеЛево   = Макет.Области.НаименованиеПолное.Лево;
	ОбластьНаименованиеПолноеПраво  = Макет.Области.НаименованиеПолное.Право;
	
	Если НЕ ПустаяСтрока(СтрокаПоиска) Тогда
		НайденнаяОбласть = ТабДокумент.НайтиТекст(СтрокаПоиска,, ТабДокумент.Области.КодЧисловой,,,, Истина);
		Если НайденнаяОбласть = Неопределено Тогда
			ТекущийЭлемент = Элементы.СтрокаПоиска;
		Иначе
			ТекущийЭлемент = Элементы.ТабДокумент;
			ТекущийЭлемент.ТекущаяОбласть = НайденнаяОбласть;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Область = Элементы.ТабДокумент.ТекущаяОбласть;
	ВыполнитьВыбор(Область);
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Функция ПоискСуществуещейЕдиницы(Знач ПараметрыФормы)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлассификаторЕдиницИзмерения.Ссылка
	|ИЗ
	|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|ГДЕ
	|	КлассификаторЕдиницИзмерения.КодПоКлассификатору = &Код";
	
	Запрос.УстановитьПараметр("Код", ПараметрыФормы.ЗначенияЗаполнения.КодПоКлассификатору);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьВыбор(ТекущаяОбласть)
	
	КодЧисловой         = ТабДокумент.Область(ТекущаяОбласть.Верх, ОбластьКодЧисловойЛево,
		ТекущаяОбласть.Низ, ОбластьКодЧисловойПраво).Текст;
	НаименованиеКраткое = ТабДокумент.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеКраткоеЛево,
		ТекущаяОбласть.Низ, ОбластьНаименованиеКраткоеПраво).Текст;
	НаименованиеПолное  = ТабДокумент.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеПолноеЛево,
		ТекущаяОбласть.Низ, ОбластьНаименованиеПолноеПраво).Текст;
	
	ЗначенияЗаполнения = Новый Структура("КодПоКлассификатору, Наименование, НаименованиеПолное",
		КодЧисловой, СтрПолучитьСтроку(НаименованиеКраткое, 1), СтрПолучитьСтроку(НаименованиеПолное, 1));
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ЕдИзм = ПоискСуществуещейЕдиницы(ПараметрыФормы);
	
	Если ЕдИзм <> Неопределено Тогда
		ПараметрыФормы.Вставить("Ключ", ЕдИзм);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.КлассификаторЕдиницИзмерения.Форма.ФормаЭлемента",
			ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Область = Элементы.ТабДокумент.ТекущаяОбласть;
	ВыполнитьВыбор(Область);
	
КонецПроцедуры

&НаКлиенте
Процедура ИскатьСтрокуВТаблице(Команда)
	
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		Предупреждение("Не задана строка поиска");
		ТекущийЭлемент = Элементы.СтрокаПоиска;
		Возврат;
	КонецЕсли;
	
	НайденнаяОбласть = ТабДокумент.НайтиТекст(СтрокаПоиска, Элементы.ТабДокумент.ТекущаяОбласть,
		,,,, Истина);
	Если НайденнаяОбласть = Неопределено Тогда
		НайденнаяОбласть = ТабДокумент.НайтиТекст(СтрокаПоиска, , , , , , Истина);
		Если НайденнаяОбласть = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Строка не найдена";
			Сообщение.Сообщить();
			
			ТекущийЭлемент = Элементы.СтрокаПоиска;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТекущийЭлемент = Элементы.ТабДокумент;
	ТекущийЭлемент.ТекущаяОбласть = НайденнаяОбласть;
	
КонецПроцедуры

#КонецОбласти
